{'inspection_id': '2313052', 'dba_name': 'FRESH START DAYCARE, INC.', 'aka_name': 'FRESH START DAYCARE', 'license_': '2215719', 'facility_type': "Children's Services Facility", 'risk': 'Risk 1 (High)', 'address': '6922-6924 W NORTH AVE ', 'city': 'CHICAGO', 'state': 'IL', 'zip': '60707', 'inspection_date': '2019-09-27T00:00:00.000', 'inspection_type': 'Canvass', 'results': 'Fail', 'violations': '2. CITY OF CHICAGO FOOD SERVICE SANITATION CERTIFICATE - Comments: NO CITY OF CHICAGO FOOD SANITATION CERTIFICATE IS POSTED ON THE PREMISES. MANAGEMENT INSTRUCTED TO HAVE A CERTIFIED FOOD MANAGER PRESENT AT ALL TIMES WHILE TCS FOODS ARE BEING PREPARED AND SERVED. PRIORITY FOUNDATION 7-38-012. CITATION ISSUED. | 3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: OBSERVED NO WRITTEN EMPLOYEE HEALTH POLICY ON THE PREMISES. MANAGEMENT INSTRUCTED TO HAVE A SIGNED EMPLOYEE HEALTH POLICY FOR EACH EMPLOYEE. PRIORITY FOUNDATION 7-38-010. NO CITATION ISSUED. | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: OBSERVED NO CLEAN UP SUPPLIES ON THE PREMISES TO RESPOND TO VOMIT AND DIARRHEAL EVENTS. MANAGEMENT INSTRUCTED TO PROVIDE ALL SUPPLIES LISTED ON YOUR CLEAN UP PROCEDURE. PRIORITY FOUNDATION 7-38-005. NO CITATION ISSUED. | 10. ADEQUATE HANDWASHING SINKS PROPERLY SUPPLIED AND ACCESSIBLE - Comments: OBSERVED 2 EXPOSED HAND WASHING SINKS INACCESSIBLE FOR USE. OBSERVED A BOX AND GARBAGE LID STORED ON TOP OF THE EXPOSED HAND WASHING SINK IN THE KITCHEN PREP AREA. ALSO, OBSERVED NO HOT WATER AT THE EXPOSED HAND WASHING SINK LOCATED IN ROOM 2. MANAGEMENT INSTRUCTED THAT ALL HAND WASHING SINKS MUST BE ACCESSIBLE FOR USE. PRIORITY FOUNDATION 7-38-030(C). CITATION ISSUED. | 38. INSECTS, RODENTS, & ANIMALS NOT PRESENT - Comments: OBSERVED EVIDENCE OF RODENT ACTIVITY ON THE PREMISES. OBSERVED APPROXIMATELY 100 MOUSE DROPPINGS LOCATED ON THE FLOOR IN THE CLOSET OF ROOM 2, TODDLER ROOM WASHROOM, UTILITY CLOSETS AND CLOSETS IN THE UNUSED CLASSROOM. MANAGEMENT INSTRUCTED TO CLEAN AND REMOVE ALL RODENT DROPPINGS FROM THE AFFECTED AREAS. ADDITIONAL PEST CONTROL SERVICE IS NEEDED TO ELIMINATE THE PEST ACTIVITY. PRIORITY FOUNDATION 7-38-020(A). CITATION ISSUED. | 40. PERSONAL CLEANLINESS - Comments: OBSERVED A FOOD HANDLING EMPLOYEE PREPARING FOOD WITHOUT A HAIR RESTRAINT. MANAGEMENT INSTRUCTED THAT ALL FOOD HANDLING EMPLOYEES MUST WEAR A HAIR RESTRAINT WHILE IN THE KITCHEN PREP AREA. | 48. WAREWASHING FACILITIES: INSTALLED, MAINTAINED & USED; TEST STRIPS - Comments: NO CHEMICAL TEST STRIPS WERE PROVIDED TO MEASURE THE CONCENTRATION OF SANITIZER AT THE 3 COMPARTMENT SINK. MANAGEMENT INSTRUCTED TO PROVIDE. PRIORITY FOUNDATION 7-38-005. CITATION ISSUED. | 49. NON-FOOD/FOOD CONTACT SURFACES CLEAN - Comments: CLEAN THE EXTERIOR OF THE GREASE TRAP AND THE CABINET IT IS LOCATED IN. | 53. TOILET FACILITIES: PROPERLY CONSTRUCTED, SUPPLIED, & CLEANED - Comments: MUST PROVIDE A COVERED WASTE RECEPTACLE INSIDE OF ALL WASHROOMS. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: OBSERVED EXCESSIVE CLUTTER ON THE FLOOR IN THE TODDLER WASHROOM AND STORAGE CLOSETS AND CLASSROOMS THAT IS CONTRIBUTING TO PEST HARBORAGE CONDITIONS. MANAGEMENT INSTRUCTED TO ELIMINATE CLUTTER IN THESE AREAS AND STORE ITEMS OFF OF THE FLOOR AND AWAY FROM THE WALLS. | 56. ADEQUATE VENTILATION & LIGHTING; DESIGNATED AREAS USED - Comments: NO WORKING VENTILATION FAN IS PROVIDED IN THE WASHROOM NEXT TO THE LAUNDRY AREA. MANAGEMENT INSTRUCTED TO REPAIR OR REPLACE THE VENTILATION FAN IN THIS WASHROOM.', 'latitude': '41.90909072583769', 'longitude': '-87.79816372279038', 'location': {'latitude': '-87.79816372279038', 'longitude': '41.90909072583769'}}
